---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.BadProblemWithGroup
source: html/bc2f2644-16cf-91a2-5d0a-bbb4cd9c443c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.BadProblemWithGroup Property

The operation performed affects groups in an unacceptable manner.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadProblemWithGroup { get; }
```